---
kind: method
id: M:Autodesk.Revit.DB.PolymeshTopology.GetPoints
source: html/691eca7c-a9e2-d082-1287-00d6e038b18f.htm
---
# Autodesk.Revit.DB.PolymeshTopology.GetPoints Method

Returns all points of the polymesh.

## Syntax (C#)
```csharp
public IList<XYZ> GetPoints()
```

## Returns
An array of XYZ coordinates